; domain
;; source: https://github.com/AI-Planning/pddl-generators/blob/main/childsnack/domain.pddl
;; updates:
;;   - :equality removed
;;   - :negative-preconditions added
;;   - action move_tray has a new precondition: (not (at ?t ?p2))

(define (domain childsnack)
(:requirements :typing :negative-preconditions)
(:types child bread-portion content-portion sandwich tray place)
(:constants kitchen - place)

(:predicates
    (at_kitchen_bread ?b - bread-portion)
	(at_kitchen_content ?c - content-portion)
    (at_kitchen_sandwich ?s - sandwich)
    (no_gluten_bread ?b - bread-portion)
    (no_gluten_content ?c - content-portion)
    (ontray ?s - sandwich ?t - tray)
    (no_gluten_sandwich ?s - sandwich)
	(allergic_gluten ?c - child)
    (not_allergic_gluten ?c - child)
	(served ?c - child)
	(waiting ?c - child ?p - place)
    (at ?t - tray ?p - place)
	(notexist ?s - sandwich)
)

(:action make_sandwich_no_gluten
	 :parameters (?s - sandwich ?b - bread-portion ?c - content-portion)
	 :precondition (and
        (at_kitchen_bread ?b)
        (at_kitchen_content ?c)
        (no_gluten_bread ?b)
        (no_gluten_content ?c)
        (notexist ?s))
	 :effect (and
        (not (at_kitchen_bread ?b))
        (not (at_kitchen_content ?c))
        (at_kitchen_sandwich ?s)
        (no_gluten_sandwich ?s)
        (not (notexist ?s)))
)

(:action make_sandwich
	 :parameters (?s - sandwich ?b - bread-portion ?c - content-portion)
	 :precondition (and
        (at_kitchen_bread ?b)
        (at_kitchen_content ?c)
        (notexist ?s))
	 :effect (and
        (not (at_kitchen_bread ?b))
        (not (at_kitchen_content ?c))
        (at_kitchen_sandwich ?s)
        (not (notexist ?s)))
)

(:action put_on_tray
	 :parameters (?s - sandwich ?t - tray)
	 :precondition (and
        (at_kitchen_sandwich ?s)
        (at ?t kitchen))
	 :effect (and
        (not (at_kitchen_sandwich ?s))
        (ontray ?s ?t))
)

(:action serve_sandwich_no_gluten
 	:parameters (?s - sandwich ?c - child ?t - tray ?p - place)
	:precondition (and
        (allergic_gluten ?c)
        (ontray ?s ?t)
        (waiting ?c ?p)
        (no_gluten_sandwich ?s)
        (at ?t ?p))
	:effect (and
        (not (ontray ?s ?t))
        (served ?c))
)

(:action serve_sandwich
	:parameters (?s - sandwich ?c - child ?t - tray ?p - place)
	:precondition (and
        (not_allergic_gluten ?c)
        (waiting ?c ?p)
        (ontray ?s ?t)
        (at ?t ?p))
	:effect (and
        (not (ontray ?s ?t))
        (served ?c))
)

(:action move_tray
	 :parameters (?t - tray ?p1 ?p2 - place)
	 :precondition (and
        (at ?t ?p1)
        (not (at ?t ?p2)))
	 :effect (and
        (not (at ?t ?p1))
        (at ?t ?p2))
))

; problem
(define (problem childsnack-98)
 (:domain childsnack)
 (:objects 
    child1 child2 child3 child4 child5 child6 child7 child8 child9 child10 - child
    tray1 tray2 tray3 - tray
    sandw1 sandw2 sandw3 sandw4 sandw5 sandw6 sandw7 sandw8 sandw9 sandw10 sandw11 sandw12 sandw13 sandw14 sandw15 - sandwich
    bread1 bread2 bread3 bread4 bread5 bread6 bread7 bread8 bread9 bread10 - bread-portion
    content1 content2 content3 content4 content5 content6 content7 content8 content9 content10 - content-portion
    table1 table2 table3 - place
    )
 (:init 
    (at tray1 kitchen)
    (at tray2 kitchen)
    (at tray3 kitchen)
    (at_kitchen_bread bread1)
    (at_kitchen_bread bread2)
    (at_kitchen_bread bread3)
    (at_kitchen_bread bread4)
    (at_kitchen_bread bread5)
    (at_kitchen_bread bread6)
    (at_kitchen_bread bread7)
    (at_kitchen_bread bread8)
    (at_kitchen_bread bread9)
    (at_kitchen_bread bread10)
    (at_kitchen_content content1)
    (at_kitchen_content content2)
    (at_kitchen_content content3)
    (at_kitchen_content content4)
    (at_kitchen_content content5)
    (at_kitchen_content content6)
    (at_kitchen_content content7)
    (at_kitchen_content content8)
    (at_kitchen_content content9)
    (at_kitchen_content content10)
    (allergic_gluten child3)
    (allergic_gluten child9)
    (allergic_gluten child5)
    (allergic_gluten child4)
    (allergic_gluten child7)
    (allergic_gluten child6)
    (not_allergic_gluten child2)
    (not_allergic_gluten child8)
    (not_allergic_gluten child1)
    (not_allergic_gluten child10)
    (no_gluten_bread bread5)
    (no_gluten_bread bread7)
    (no_gluten_bread bread4)
    (no_gluten_bread bread2)
    (no_gluten_bread bread9)
    (no_gluten_bread bread6)
    (no_gluten_content content5)
    (no_gluten_content content10)
    (no_gluten_content content2)
    (no_gluten_content content6)
    (no_gluten_content content3)
    (no_gluten_content content9)
    (waiting child3 table3)
    (waiting child9 table1)
    (waiting child5 table2)
    (waiting child4 table1)
    (waiting child7 table1)
    (waiting child6 table3)
    (waiting child2 table1)
    (waiting child8 table2)
    (waiting child1 table2)
    (waiting child10 table1)
    (notexist sandw1)
    (notexist sandw2)
    (notexist sandw3)
    (notexist sandw4)
    (notexist sandw5)
    (notexist sandw6)
    (notexist sandw7)
    (notexist sandw8)
    (notexist sandw9)
    (notexist sandw10)
    (notexist sandw11)
    (notexist sandw12)
    (notexist sandw13)
    (notexist sandw14)
    (notexist sandw15))
 (:goal (and 
(served child5)
))
)

; plan
1. (make_sandwich_no_gluten sandw10 bread2 content10)
   deleted: (at_kitchen_bread bread2) (at_kitchen_content content10) (notexist sandw10)
   added: (at_kitchen_sandwich sandw10) (no_gluten_sandwich sandw10)
   goals met: 0 of 1
2. (put_on_tray sandw10 tray3)
   deleted: (at_kitchen_sandwich sandw10)
   added: (ontray sandw10 tray3)
   goals met: 0 of 1
3. (move_tray tray3 kitchen table2)
   deleted: (at tray3 kitchen)
   added: (at tray3 table2)
   goals met: 0 of 1
4. (serve_sandwich_no_gluten sandw10 child5 tray3 table2)
   deleted: (ontray sandw10 tray3)
   added: (served child5)
   goals met: 1 of 1
